---
type: FilteredElementIdIterator
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# FilteredElementIdIterator

`Autodesk.Revit.DB.FilteredElementIdIterator` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCurrent | 2011 | `public ElementId GetCurrent ()` |
| Method | IsDone | 2011 | `public virtual bool IsDone ()` |
| Method | MoveNext | 2011 | `public virtual bool MoveNext ()` |
| Method | Reset | 2011 | `public virtual void Reset ()` |
| Property | Current | — | `public virtual ElementId Current { get ; }` |
| Property | CurrentObject | — | `internal Object CurrentObject { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |